"""
Упражнения к практической работе 66: Управление зависимостями

Выполните упражнения по управлению зависимостями.
"""

# Упражнение 1: Dependency inventory
def exercise_dependency_inventory():
    """
    Создайте инвентаризацию зависимостей.
    """
    # Определите все зависимости
    # Проверьте версии
    # Документируйте зависимости
    pass


# Упражнение 2: Vulnerability scanning
def exercise_vulnerability_scanning():
    """
    Сканируйте уязвимости в зависимостях.
    """
    # Используйте safety или pip-audit
    # Проверьте CVE базу
    # Создайте отчёт
    pass


# Упражнение 3: Dependency updating
def exercise_dependency_updating():
    """
    Обновите зависимости безопасно.
    """
    # Проверьте совместимость
    # Используйте virtual environment
    # Протестируйте после обновления
    pass


# Упражнение 4: Pinning dependencies
def exercise_pinning_dependencies():
    """
    Зафиксируйте версии зависимостей.
    """
    # Используйте requirements.txt
    # Зафиксируйте версии
    # Проверьте lock файл
    pass


# Упражнение 5: Private packages
def exercise_private_packages():
    """
    Управляйте приватными пакетами.
    """
    # Настройте private PyPI
    # Управляйте токенами
    # Безопасно храните credentials
    pass


if __name__ == "__main__":
    print("Упражнения по управлению зависимостями")
    exercise_dependency_inventory()
    exercise_vulnerability_scanning()
    exercise_dependency_updating()
    exercise_pinning_dependencies()
    exercise_private_packages()
