"""
Упражнения к практической работе 54: Мониторинг и логирование

Выполните упражнения по настройке мониторинга и логирования.
"""

# Упражнение 1: Настройка логирования
def exercise_logging():
    """
    Настройте систему логирования.
    """
    # Создайте модуль логирования
    # Настройте уровни логирования (DEBUG, INFO, WARNING, ERROR)
    # Настройте формат логов
    pass


# Упражнение 2: Структурное логирование
def exercise_structured_logging():
    """
    Реализуйте структурное логирование.
    """
    # Используйте JSON формат для логов
    # Добавьте контекстную информацию
    # Интегрируйте с ELK стеком
    pass


# Упражнение 3: Метрики приложения
def exercise_application_metrics():
    """
    Соберите метрики приложения.
    """
    # Создайте счётчики (counters)
    # Создайте гистограммы (histograms)
    # Используйте Prometheus для сбора метрик
    pass


# Упражнение 4: Health checks
def exercise_health_checks():
    """
    Реализуйте проверки здоровья приложения.
    """
    # Создайте liveness probe
    # Создайте readiness probe
    # Настройте мониторинг зависимостей
    pass


# Упражнение 5: Алерты
def exercise_alerting():
    """
    Настройте систему оповещений.
    """
    # Определите правила алертинга
    # Интегрируйте с PagerDuty или Telegram
    # Настройте эскалацию алертов
    pass


if __name__ == "__main__":
    print("Упражнения по мониторингу и логированию")
    exercise_logging()
    exercise_structured_logging()
    exercise_application_metrics()
    exercise_health_checks()
    exercise_alerting()
