"""
Упражнения к практической работе 57: Основы криптографии

Выполните упражнения по основам криптографии.
"""

# Упражнение 1: Хеширование паролей
def exercise_password_hashing():
    """
    Реализуйте безопасное хеширование паролей.
    """
    # Используйте bcrypt для хеширования
    # Добавьте соль (salt)
    # Проверьте надежность пароля
    pass


# Упражнение 2: Симметричное шифрование
def exercise_symmetric_encryption():
    """
    Реализуйте симметричное шифрование.
    """
    # Используйте AES для шифрования
    # Сгенерируйте ключ
    # Зашифруйте и расшифруйте данные
    pass


# Упражнение 3: Асимметричное шифрование
def exercise_asymmetric_encryption():
    """
    Реализуйте асимметричное шифрование.
    """
    # Сгенерируйте RSA ключи
    # Зашифруйте данные открытым ключом
    # Расшифруйте закрытым ключом
    pass


# Упражнение 4: Цифровые подписи
def exercise_digital_signatures():
    """
    Реализуйте цифровые подписи.
    """
    # Создайте подпись данных
    # Проверьте подпись
    # Используйте RSA или ECDSA
    pass


# Упражнение 5: Безопасная генерация случайных чисел
def exercise_secure_random():
    """
    Реализуйте безопасную генерацию случайных чисел.
    """
    # Используйте secrets модуль
    # Сгенерируйте токены
    # Создайте криптографические ключи
    pass


if __name__ == "__main__":
    print("Упражнения по основам криптографии")
    exercise_password_hashing()
    exercise_symmetric_encryption()
    exercise_asymmetric_encryption()
    exercise_digital_signatures()
    exercise_secure_random()
