"""
Упражнения к практической работе 62: Шифрование данных

Выполните упражнения по шифрованию данных.
"""

# Упражнение 1: Encryption at rest
def exercise_encryption_at_rest():
    """
    Реализуйте шифрование данных в покое.
    """
    # Шифруйте файлы на диске
    # Используйте AES для шифрования
    # Управляйте ключами шифрования
    pass


# Упражнение 2: Encryption in transit
def exercise_encryption_in_transit():
    """
    Реализуйте шифрование данных при передаче.
    """
    # Используйте HTTPS
    # Настройте TLS 1.3
    # Принудительно используйте HTTPS
    pass


# Упражнение 3: Database encryption
def exercise_database_encryption():
    """
    Шифруйте данные в базе данных.
    """
    # Шифруйте отдельные поля
    # Используйте Transparent Data Encryption
    # Управляйте ключами для БД
    pass


# Упражнение 4: Key management
def exercise_key_management():
    """
    Управляйте ключами шифрования.
    """
    # Создайте Key Management Service
    # Ротируйте ключи
    # Безопасно храните ключи
    pass


# Упражнение 5: Field-level encryption
def exercise_field_encryption():
    """
    Реализуйте шифрование на уровне полей.
    """
    # Шифруйте конфиденциальные поля
    # Дешифруйте данные по требованию
    # Интегрируйте с ORM
    pass


if __name__ == "__main__":
    print("Упражнения по шифрованию данных")
    exercise_encryption_at_rest()
    exercise_encryption_in_transit()
    exercise_database_encryption()
    exercise_key_management()
    exercise_field_encryption()
