"""
Упражнения к практической работе 59: Основы пентестинга

Выполните упражнения по основам тестирования на проникновение.
"""

# Упражнение 1: Сканирование портов
def exercise_port_scanning():
    """
    Выполните сканирование портов.
    """
    # Определите открытые порты
    # Определите запущенные сервисы
    # Создайте отчёт о сканировании
    pass


# Упражнение 2: Анализ уязвимостей
def exercise_vulnerability_analysis():
    """
    Проведите анализ уязвимостей.
    """
    # Определите потенциальные уязвимости
    # Оцените критичность уязвимостей
    # Создайте рекомендации по исправлению
    pass


# Упражнение 3: SQL Injection тестирование
def exercise_sql_injection_testing():
    """
    Протестируйте SQL инъекции.
    """
    # Определите точки ввода
    # Тестируйте различные payloads
    # Документируйте результаты
    pass


# Упражнение 4: XSS тестирование
def exercise_xss_testing():
    """
    Протестируйте XSS уязвимости.
    """
    # Тестируйте reflected XSS
    # Тестируйте stored XSS
    # Проверьте DOM-based XSS
    pass


# Упражнение 5: Password auditing
def exercise_password_auditing():
    """
    Проведите аудит паролей.
    """
    # Проверьте сложность паролей
    # Тестируйте словарные пароли
    # Оцените политику паролей
    pass


if __name__ == "__main__":
    print("Упражнения по основам пентестинга")
    exercise_port_scanning()
    exercise_vulnerability_analysis()
    exercise_sql_injection_testing()
    exercise_xss_testing()
    exercise_password_auditing()
